<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.kkeilson.download.duik</string>

    <key>Input</key>
    <dict>
        <key>REPO</key>
        <string>RxLaboratory/Duik</string>
        <key>GITHUB_TOKEN</key>
        <string>%GITHUB_TOKEN%</string>
        <key>NAME</key>
        <string>Duik</string>
    </dict>

    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>%REPO%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
